Repository: danjhd/deepracer-event
Catalog: flask-app/app/translations/*/LC_MESSAGES/messages.po
Languages: de, pt

source: Please enter the Role Arn here:
de: Bitte tragen Sie die Arn der IAM-Rolle ein:
pt: Insira o Arn da Função aqui:

source: Enter the AWS IAM Role arn
de: Geben Sie die Arn der IAM-Rolle ein
pt: Insira o arn da função do AWS IAM

source: Must be a valid AWS IAM Role arn in the format: arn:aws:iam::{AccountId}:role/{RoleNameWithPath}
de: Geben Sie eine gültige Arn einer IAM Rolle ein, im Format: arn:aws:iam::{AccountId}:role/{RoleNameWithPath}
pt: Deve ser um arn válido da função do AWS IAM no formato: arn:aws:iam::{AccountId}:role/{RoleNameWithPath}

source: Submit
de: Absenden
pt: Submeter

source: Account Id:
pt: ID da conta:

source: Enter the AWS Account Id
pt: Insira o ID da conta da AWS

source: Must be a valid AWS Account Id. (12 digits e.g. 123456789012)
pt: Deve ser um ID de conta da AWS válido (12 dígitos, por exemplo, 123456789012)

source: Model File
pt: Ficheiro de modelo

source: Upload
de: Hochladen
pt: Carregar

source: No Models were found. Please verify the account has Deep Racer models and the IAM role supplied has the correct permissions to access them.
de: Keine Modelle gefunden. Bitte überprüfen Sie dass Ihr Account Deep Racer Modelle beinhaltet und die von Ihnen angegebene IAM Rolle die notwendigen Zugriffsrechte auf diese gewährt.
pt: Nenhum modelo foi encontrado. Verifique se a conta possui modelos Deep Racer e se a função do IAM fornecida tem as permissões corretas para acessá-los.

source: You selected a file with an invalid filename. Please ensure you select a downloaded model file with extension .tar.gz
de: Sie haben eine Datei mit einem ungültigen Dateinamen ausgewählt. Bitte verwenden Sie nur heruntergeladene Modelldateien vom Dateityp .tar.gz
pt: Selecionou um ficheiro com um nome de arquivo inválido. Certifique-se de selecionar um ficheiro de modelo com a extensão .tar.gz

source: A model with the same name already exists, file upload cancelled.
de: Ein Modell mit dem gleichen Namen existiert bereits, Dateiupload wurde abgebrochen.
pt: Já existe um modelo com o mesmo nome, o upload do ficheiro foi cancelado.

source: File successfully uploaded.
de: Datei wurde erfolgreich hochgeladen.
pt: Ficheiro carregado com sucesso.

source: Model is present
de: Modell ist vorhanden
pt: Modelo não presente

source: Delete
de: Löschen
pt: Excluir

source: Model is not present
de: Modell ist nicht vorhanden
pt: O modelo não está presente

source: File Not Found
de: Datei nicht gefunden
pt: Ficheiro não encontrado

source: Back
de: Zurück
pt: Voltar

source: An unexpected error has occurred
de: Es ist ein unerwarteter Fehler aufgetreten
pt: Ocorreu um erro inesperado

source: The administrator has been notified. Sorry for the inconvenience!
de: Der Administrator wurde informiert, bitte entschuldigen Sie die Unannehmlichkeiten!
pt: O administrador foi notificado. Desculpe pelo inconveniente!

source: Home
de: Startseite
pt: Inicio

source: Role Upload
de: Rolle hochladen
pt: Definição de Função

source: S3 Upload
de: Mit S3 hochladen
pt: Carregamento do S3

source: Loading
de: Lade
pt: Carregando

source: This site allows you to upload Deep Racer models directly onto the cars.
de: Diese Seite ermöglicht es Ihnen ihre Deep Racer Modelle direkt in die Fahrzeuge zu laden.
pt: Este site permite que você carregue modelos Deep Racer diretamente para os carros.

source: There are two methods available
de: Es stehen zwei Methoden zur Verfügung
pt: Existem dois métodos disponíveis

source: This requires you to create an IAM role in your AWS account that has access to the Deep Racer Models. This application will then assume the supplied role and list the available models. You are then able click and choose which model(s) you wish to upload (or delete) from the cars.
de: Es ist notwendig, dass Sie eine IAM Rolle erstellen, die die notwendigen Rechte hat um auf die Deep Racer Modelle zuzugreifen. Diese Anwendung wird dann diese Rolle annehmen um die verfügbaren Modelle anzuzeigen. Aus den angezeigten Modellen können Sie dann die Modelle wählen, die Sie auf die Fahrzeuge laden oder löschen wollen.
pt: Isso requer que você crie uma função do IAM em sua conta da AWS que tenha acesso aos modelos Deep Racer. Este aplicativo assumirá a função fornecida e listará os modelos disponíveis. Você pode então clicar e escolher qual (s) modelo (s) você deseja carregar (ou excluir) dos carros.

source: This method is simpler in concept. You have the option to upload a model from your local computer to this site. The site will then transfer the model down to the car. This method therefore does not require you to create a role in your AWS account, but it could be considered more work anyway, since you will need to log in and download the model from your account manually first.
de: Mit dieser etwas einfacheren Methode können sie ein Deep Racer Modell von Ihrem PC auf diese Seite hochladen. Das Modell wird dann von dieser Applikation auf das Fahrzeug geladen. Sie brauchen also keine IAM Rolle konfigurieren, dafür müssen Sie aber die Modelle zuvor aus dem AWS Account auf Ihren lokalen PC herunterladen.
pt: Este método é mais simples no conceito. Você tem a opção de carregar um modelo do seu computador local para este site. O site irá então transferir o modelo para o carro. Portanto, esse método não exige que você crie uma função em sua conta da AWS, mas ele poderia ser considerado mais trabalho de qualquer maneira, já que você precisará fazer login e fazer o download do modelo da sua conta manualmente primeiro.

source: The results of both methods are identical. The difference is down to personal preference.
de: The Ergebnisse beider Methoden sind identisch.
pt: Os resultados de ambos os métodos são idênticos. A diferença se resume à preferência pessoal.

source: To proceed please choose the option you prefer from the navigation bar above.
de: Bitte wählen Sie eine der beiden Optionen aus der oberen Navigationsleiste um weiter zu machen.
pt: Para prosseguir, escolha a opção preferida na barra de navegação acima.

source: Please note that this list may include Deep Racer models you have deleted from the Deep Racer console but are still present in Sagemaker. (These are still valid models to use. They are listed because the results of the training job are not deleted from S3 when the model is deleted from the Deep Racer Console.
de: Bitte bachten Sie, dass diese Liste möglicherweise Deep Racer Modelle anzeigt die Sie aus der Deep Racer Konsole gelöscht haben, wenn diese noch in Sagemaker vorliegen. (Diese Modelle können weiterhin genutzt werden, sie werden angezeigt weil die Ergebnisse der Trainings-Jobs in Sagemaker nicht aus S3 gelöscht werden, wenn die Modelle in der Deep Racer Konsole gelöscht werden.)
pt: Note que esta lista pode incluir modelos Deep Racer que você excluiu do console Deep Racer, mas ainda estão presentes no Sagemaker. (Estes ainda são modelos válidos para usar. Eles são listados porque os resultados do trabalho de treino de modelos não são excluídos do S3 quando o modelo é excluído do Deep Racer Console.

source: Model
de: Modell
pt: Modelo

source: Uploaded
de: Hochgeladen
pt: Carregado

source: Delete model
de: Modell löschen
pt: Eliminar modelo

source: Upload model
de: Modell hochladen
pt: Carregar modelo

source: This application allows you to upload Deep Racer models trained in your own AWS account to the Deep Racer cars for this event.
de: Mit dieser Anwendung können Sie Ihre Deep Racer Modelle, die Sie in Ihrem AWS Account trainiert haben, für dieses Event in Ihr Fahrzeug laden.
pt: Este aplicativo permite que você carregue modelos Deep Racer treinados em sua própria conta da AWS para os carros Deep Racer deste evento.

source: To use this application we ask you to create an IAM role in your account that this application will use to access your models and upload them to the car.
de: Um diese Anwendung zu nutzen, möchten wir Sie bitten ein IAM Rolle in Ihrem Account mit den notwendigen Rechten anzulegen. Diese Rolle wird dann verwendet um auf die Modelle zuzugreifen und in die Fahrzeuge zu laden.
pt: Para usar este aplicativo, pedimos que você crie uma função de IAM na sua conta que este aplicativo usará para acessar seus modelos e enviá-los para o carro.

source: Please click this
de: Bitte folgen Sie diesem
pt: Por favor, clique neste

source: to download a
de: um eine Vorlage für
pt: para baixar um modelo de

source: template which will deploy the role for you.
de: herunterzuladen. Es wird die notwendige Rolle für Sie erstellen.
pt: que irá implementar a função para você.

source: If you prefer to create the IAM role yourself manually please click here to show the required policies.
de: Falls Sie es vorziehen die Rolle manuell zu erstellen, folgen Sie bitte diesem Link um die notwendigen Richtlinien anzuzeigen.
pt: Se você preferir criar a função do IAM manualmente, clique aqui para mostrar as políticas necessárias.

source: Trust relationship
de: Vertrauens-Beziehung
pt: Relação de confiança

source: Policy
de: Richtlinie
pt: Política

source: please replace the highlighted sections with values specific to your AWS account
de: Bitte ersetzen Sie die markierten Stellen mit den Werten die für Ihr AWS Konto zutreffen
pt: substitua as seções destacadas por valores específicos para sua conta da AWS

source: This option allows you to manually upload a previously downloaded Deep Racer Model file. Use this option if you prefer not to create and provide an IAM role.
de: Mit dieser Option können Sie manuell eine zuvor heruntergeladene Deep Racer Modelldatei hochladen. Verwenden Sie diese Option, wenn Sie keine IAM-Rolle erstellen und bereitstellen möchten.
pt: Esta opção permite que você carregue manualmente um ficheiro Deep Racer Model baixado anteriormente. Use essa opção se preferir não criar e fornecer uma função do IAM.

source: First, access the Deep Racer console in your AWS account and download the Model to your local computer.
de: Öffnen Sie zunächst die Deep Racer-Konsole in Ihrem AWS-Konto und laden Sie das Modell auf Ihren lokalen Computer herunter.
pt: Primeiro, acesse a consola Deep Racer em sua conta da AWS e faça o download do modelo para o computador local.

source: Click here to show a screenshot of how to download the model.
de: Klicken Sie hier, um einen Screenshot zu zeigen, wie Sie das Modell herunterladen können.
pt: Clique aqui para mostrar uma captura de tela de como baixar o modelo.

source: Next, complete the form below. When choosing the Model File select the file downloaded previously to upload this model. The Account Id is required to ensure that Model names are unique.
de: Als nächstes füllen Sie das untenstehende Formular aus. Bei der Auswahl der Modelldatei, verwenden Sie die Datei, die zuvor heruntergeladen wurde. Die Konto-ID ist erforderlich, um sicherzustellen, dass Modellnamen eindeutig sind.
pt: Em seguida, preencha o formulário abaixo. Ao escolher o Ficheiro de Modelo, selecione o arquivo baixado anteriormente para fazer upload deste modelo. O ID da conta é necessário para garantir que os nomes de modelo sejam exclusivos.

source: Click here to show a screenshot of how to find your account id.
de: Klicken Sie hier, um einen Screenshot zu zeigen, wie Sie Ihre Account-ID finden.
pt: Clique aqui para mostrar uma captura de ecran de como encontrar seu id de conta.
